{
	"home_page":"home page",
	"other_projects":"other projects",
	"about_me":"About me",
	"contacts":"contacts",
	"play":"Play",
	"demo":"Demo project",
	"not_wide_enough":"The page isn't wide enough to display the demo.",
	"vg_projects":"Video game projects",
	"demo_desc":"As you awake in this empty room, an oppressive gaze weighs upon you. As you walk closer to the alter in the room's centre, you feel an irresistible urge to reach out for it... But as your hand touches the cold stone, the gaze intensifies and a power courses through the ruins. The Ancient Guardian has awakened and his wrathful stare is upon you...",
	"demo_technical_desc":"This demo shows my skills as a video game developer.\nEverything has been done by me. As I am not an artist, all the visuals are made out of shaders and every animation is procedural.\n\nThis project is still a work in progress and will be regularly updated.\n\nControles (kb&m/controller):\n- Space bar/A --> Dash\n- LMB/X --> Light Attack\n- RMB/Y --> Heavy Attack\n- MMB/B --> Ranged Attack\n\nKnown issues:\n- Some programs (such as Steam) make a controller sending keyboard inputs which results into unwanted behaviour.\n- Due to Unity limitations, Playstation controllers do not support haptic feedbacks over bluetooth.",
	"links":"Links",
	"dl":"Downloads",
	"linux_archive":"Linux Archive",
	"windows_archive":"Windows Archive",
	"itch":"itch.io page",
	"youtube":"trailer",
	"ldjam":"Ludum Dare page",
	"ld_desc":"Lone Defender is an asymmetric game where a mobile player plays as the Master of AI, and the VR player plays as the Lone Defender.\nThe Master of AI is controlling the army of machines that are attacking the Lone Defender. Dispatch your units on the battlefield. Subdue the Lone Defender and crush mankind's last hope!\nMeanwhile, the Lone Defender must survive and ensure its platform stays up and healthy as the hordes of machine will try to destroy the two generators holding it together. Use your reflexes to slash the machines. Defend the generators and the core, even if it means death.",
	"hellward_desc":"Step into the role of a divine ambassador, tasked with defending against a wicked ritual that threatens to plunge the world into darkness. Confronted by a towering pentacle and an perfidious necromancer, you stand your ground knowing that the end draws near. With only the holy light within you to rely on, brace yourself for relentless waves of monstrous foes sent by the necromancer.\nHow long can you withstand the onslaught and protect the realm from ultimate doom? Prepare for a survival-defense experience where your faith and resilience will be put to the ultimate test.\n\nMade for the Ludum Dare 55 with theme \"Summoning\".",
	"hcf_desc":"Heroic Chrono Fantasy is between a rogue-like and a party game. Crawl through a dungeon and kill as many enemies as possible by succeeding mini-games. Evolve your character as you gain points and survive the waves of enemies spawning every 10 seconds.\n\nMade for the Ludum Dare 51 with theme \"Every 10 seconds\".",
	"schwoof_desc":"A game about a shepherd dog and some sheep... Prevent the sheep from escaping the field by barking at them!\n\nMade for the Gaming Rouen 2023 Game Jam.",
	"mpccp_desc":"\"Mais pourquoi ça cuit pas ?!...\" narrate the thrilling adventure of a normand eager to savor a deliciously baked camembert! Alas, though brief, this adventure at 180°C may not go as planned...\n\nMade for the Gaming Rouen 2024 Game Jam",
	"bulle_et_hell_desc":"You are trapped in a bubble that slowly shrinks as time passes... and to make things worse, worms are coming to suck the air out of your bubble. Your mission: survive.\n\nMade for the Global Game Jam 2025 (Cergy)",
	"my_desc_presentation":"Hey, I'm Martin, I'm 23 year old and from the Ile-De-France. Curious and thirsty for knowledge, I am interested in sciences, mainly Computer Science.",
	"my_passions":"My passions",
	"my_desc_passions":"I am passionate about computer science and video games. I play (A)RPG, mainly the Souls and Monster Hunter series and I also greatly enjoy turn-based Rogue-likes (my favourites being FTL and Darkest Dungeon). I do pen and paper RPG (mostly Dungeons and Dragons) and I paint Warhammer Age of Sigmar minis. I am a drummer since the age of 8 and I was in a Jazz Band prior to my higher education. I also take care of myself with cooking and sports.",
	"cs_and_me":"Computer science and me",
	"my_desc_cs":"I have a Bachelor's Degree in computer science from the Paris-Saclay University and a Master's Degree of Manager in Computer Science's Engineering specialized in Gaming & Smart tech from the ESIEE-IT.\n\nSince I'm 10 I've been tinkering with my computer, but it's only around the age of 15 that I wanted to learn how to code. I self-learned the C with the Open Classroom's course. At the end of Highschool, I was hesitating between Physics and Computer Science, thus I did a Mathematics, Physics and Computer Science Bachelor. At the end of the first year we had to chose which field to continue: I chose computer science. It has been 8 years that I am developping for personal projects as well as my studies.\n\nDuring the Bachelor, I studied C++ and Java. I learned Unity and C# during the Master's degree and am working with them since. I got acquainted with virtual reality development because we decided to do our Master degree's project (Lone Defender) in virtual reality. I have a solid knowledge of Object Oriented Programming, mostly in C#. For my work, I spent 3 years developing in Dart (with Flutter). I use Git for all of my projects.",
	"my_experiences":"My work experiences",
	"my_desc_experiences":"I worked for 3 years as a Flutter Developer for Active SAS in apprenticeship then in permanent contract.",
	"download_cv":"Download my CV"
}