{
	"home_page":"home page",
	"other_projects":"other projects",
	"about_me":"About me",
	"contacts":"contacts",
	"play":"Play",
	"demo":"Demo project",
	"vg_projects":"Video game projects",
	"demo_desc":"This project despite being small shows all of my techincal skills.\nThe boss is controlled by a behaviour tree and the player uses a finite state machine for its actions.\nEvery animation is procedural and all visuals are made of shaders.",
	"links":"Links",
	"dl":"Downloads",
	"linux_archive":"Linux Archive",
	"windows_archive":"Windows Archive",
	"itch":"itch.io page",
	"youtube":"trailer",
	"ldjam":"Ludum Dare page",
	"ld_desc":"Lone Defender is an asymmetric game where a mobile player plays as the Master of AI, and the VR player plays as the Lone Defender.\nThe Master of AI is controlling the army of machines that are attacking the Lone Defender. Dispatch your units on the battlefield. Subdue the Lone Defender and crush mankind's last hope!\nMeanwhile, the Lone Defender must survive and ensure its platform stays up and healthy as the hordes of machine will try to destroy the two generators holding it together. Use your reflexes to slash the machines. Defend the generators and the core, even if it means death.",
	"hellward_desc":"Step into the role of a divine ambassador, tasked with defending against a wicked ritual that threatens to plunge the world into darkness. Confronted by a towering pentacle and an perfidious necromancer, you stand your ground knowing that the end draws near. With only the holy light within you to rely on, brace yourself for relentless waves of monstrous foes sent by the necromancer.\nHow long can you withstand the onslaught and protect the realm from ultimate doom? Prepare for a survival-defense experience where your faith and resilience will be put to the ultimate test.\nMade for the Ludum Dare 55 with theme \"Summoning\".",
	"hcf_desc":"Heroic Chrono Fantasy is between a rogue-like and a party game. Crawl through a dungeon and kill as many enemies as possible by succeeding mini-games. Evolve your character as you gain points and survive the waves of enemies spawning every 10 seconds.\n\nMade for the Ludum Dare 51 with theme \"Every 10 seconds\".",
	"schwoof_desc":"A game about a shepherd dog and some sheep... Prevent the sheep from escaping the field by barking at them!\n\nMade for the Gaming Rouen 2023 Game Jam.",
	"mpccp_desc":"\"Mais pourquoi ça cuit pas ?!...\" narrate the thrilling adventure of a normand eager to savor a deliciously baked camembert! Alas, though brief, this adventure at 180°C may not go as planned...\n\nMade for the Gaming Rouen 2024 Game Jam",
	"my_desc_presentation":"Hey, I'm Martin. I have a Bachelor's Degree in computer science at the Paris-Saclay University and a Master's Degree in Manager in Computer's Engineering specialized in Gaming & Smart tech at the ESIEE-IT.",
	"my_passions":"My passions",
	"my_desc_passions":"I am passionate about computer science and video games. I play (A)RPG, mainly the Souls and Monster Hunter series and I also greatly enjoy turn-based Rogue-likes (my favourites being FTL and Darkest Dungeon). I do pen and paper RPG (mostly Dungeons and Dragons). Lastly, I paint Warhammer Age of Sigmar minis.",
	"cs_and_me":"Computer science and me",
	"my_desc_cs":"Since I'm a kid, I've been tinkering with my computer. It's only around the age of 15 that I suddently decided to learn how to code. I then followed the C course on Open Classroom. At the end of Highschool, I was hesitating between Physics and Computer Science, thus I did a generic Mathematics, Physics and Computer Science bachelor. At the end of the first year we had to chose which bachelour to continue. I chose computer science. It has been 8 years that I am developping and doing small scale projects for myself or for my studies.",
	"my_experiences":"My work experiences",
	"my_desc_experiences":"I worked as a Flutter Developer for Active SAS in apprenticeship then in permanent contract for 3 years.",
	"download_cv":"Download my CV"
}