{
	"home_page":"page d'accueil",
	"other_projects":"autres projets",
	"about_me":"A propos de moi",
	"contacts":"contacts",
	"play":"Jouer",
	"demo":"Projet de démo",
	"vg_projects":"Projets de jeu vidéo",
	"demo_desc":"Ce projet bien que petit montre l'ensemble de mes compétences techniques.\nLe boss est contrôlé par un behaviour tree et le joueur utilise une machine à état fini pour ses actions.\nToute les animations sont faites procéduralements et les visuels sont en shaders.",
	"links":"Liens",
	"dl":"Téléchargements",
	"linux_archive":"Archive Linux",
	"windows_archive":"Archive Windows",
	"itch":"page itch.io",
	"youtube":"trailer",
	"ldjam":"page Ludum Dare",
	"ld_desc":"Lone Defender est un jeu asymmetric où un joueur sur téléphone joue le Maître des IA et un joueur en VR  joue le Lone Defender.\nLe Maître des IA controlle une armée de machines qui attaquent le Lone Defender. Déploie des unités sur le champ de bataille. Soumet le Lone Defender et écrase le dernier espoir de l'humanité !\nPendant ce temps, le Lone Defender doit survivre et s'assumer que sa plateforme reste stable et en bon état pendant que les hordes de machine essayent de détruire les deux générateurs qui maintiennent le tout en place. Utilise tes réflexes pour trancher les machines. Défend les générateur et le Noyau, même si cela implique la mort.",
	"hellward_desc":"Incarnez un ambassadeur divin chargé de défendre le monde contre un rituel maléfique qui menace de plonger le monde dans les ténèbres. Fance à un immense pentacle et un perfide nécromancien, vous vous gardez votre position sachant que la fin est proche. Armé uniquement de la lumière sacré qui brûle en vous, préparez-vous à affronter des vagues incessantes de créatures monstrueuses invoquées par le nécromancien.\nPendant combien de temps pourrez-vous résister à l'assault et protéger le monde de la perdition ultime ? Préparez-vous à une expérience de survie et de défense où votre foi et votre résilience seront mises à l'épreuve ultime.\nRéalisé pour la Ludum Dare 55 avec pour thème \"Invocation\".",
	"hcf_desc":"Heroic Chrono Fantasy est la rencontre entre un rogue-like et un party game. Explorez le donjon et tuez autant d'ennemies que possible en réussissant les mini-jeux. Évoluez votre personnage avec les points que vous gagnez et survivez aux vagues d'ennemies qui apparaissent toute les 10 secondes.\n\nRéalisé pour la Ludum Dare 51 qui a pour thème \"Toute les 10 secondes\".",
	"schwoof_desc":"Un jeu a propos d'un chien de berger et de moutons... Empêchez les moutons de s'echapper du champs en leur aboyant dessus !\n\nRéalisé pour la Game Jam Gaming Rouen 2023.",
	"mpccp_desc":"\"Mais pourquoi ça cuit pas ?!...\" narre la trépidante aventure d'un normand souhaitant se délecter d'un savoureux camembert doré au four !\nHélas, bien que succincte, cette aventure, thermostat 7, risque de ne pas se dérouler comme prévu...\n\nRéalisé pour la Game Jam Gaming Rouen 2024",
	"my_desc_presentation":"Bonjour, je m'appelle Martin, je suis un francilien de 23 ans. Curieux et avide de connaissances, je m'interesse à la science et en particulier à l'informatique.",
	"my_passions":"Mes passions",
	"my_desc_passions":"Je suis passioné d'informatique et de jeux vidéo. Je suis un joueur de (A)RPG, en particulier la série des Souls et Monster Hunter et j'affectionne aussi beaucoup les Rogue-likes tour par tour (mes préférés étant FTL et Darkest Dungeon). Je fais du jeu de rôle papier (principalement Donjons et Dragons) et je peins des figurines Warhammer Age of Sigmar. Je fais de la batterie depuis que j'ai 8 ans et j'étais dans un groupe de Jazz avant mes études supérieures. Je prends aussi soin de moi en cuisinant et en faisant du sport.",
	"cs_and_me":"L'informatique et moi",
	"my_desc_cs":"J'ai une licence d'informatique à l'université Paris-Saclay et un Master Manager en Ingénierie Informatique spécialité Gaming & Smart Tech à l'ESIEE-IT.\n\nDès 10 ans je bidouillais avec mon ordinateur, mais ce n'est que vers l'âge de 15 ans que j'ai eu l'envie d'apprendre à développer. J'ai alors appris en autodidacte le C avec la formation d'Open Classroom. A la fin du lycée, hésitant entre la physique et l'informatique, j'ai fait une licence générale Mathématiques, Physique et Informatique. A l'issue de la première année, il fallait faire un choix entre ces trois matières : j'ai alors décidé de continuer mes études dans l'informatique. Cela fait donc 8 ans que je fais du developpement aussi bien pour des projets personnels que pour mes études.\n\nDurant la licence, j'ai étudié le C++ et le Java. J'ai appris Unity et le C# en Master et je travaille avec depuis. J'ai pu me familiariser avec le développement en réalité virtuelle car nous avons décidé de faire notre projet de Master (Lone Defender) en réalité virtuelle. J'ai donc de solides connaissances en Programmation Orientée Objet, principalement en C#. Dans le cadre de mon travail, j'ai passé 3 ans à développer en Dart (avec Flutter). J'utilise Git pour l'ensemble de mes projets.",
	"my_experiences":"Mes expériences de travail",
	"my_desc_experiences":"Pendant 3 ans, j'ai travaillé en tant que développeur flutter pour Active SAS en alternance puis en CDI.",
	"download_cv":"Télécharger mon CV"
}